{"Headline":"Minnesota election calendar 2018","Byline":"Star Tribune Staff","Leadin":"With a competitive governor’s race, two U.S. Senate races and more tossup Congressional races than any other state, Minnesota’s midterm elections this year are already in the national spotlight. Mark these key dates to follow along and participate. And <a href=\"http://www.startribune.com/politics/elections/\">follow the Star Tribune’s election coverage here</a>.","Source":"Star Tribune reporting","dates":[{"Date-text":"June 1-3","Date-formatted":"2018-06-01","Title":"State conventions","Text":"Republicans will meet in Rochester and the DFL will meet in Duluth to decide which candidates each party’s delegates will endorse. Endorsements can provide a political boost to a candidate but are not necessary to continue in the race. For example, former Gov. Tim Pawlenty, a Republican, has opted <a href=\"http://www.startribune.com/pawlenty-will-not-seek-gop-endorsement-in-governor-s-race/482714131/\">not to seek his party’s endorsement</a> but will still run in the primary."},{"Date-text":"June 5","Date-formatted":"2018-06-05","Title":"Candidate filing period ends","Text":"Candidates have until today to decide whether they are in or out of the election. Some candidates will await the outcome of the previous weekend’s party endorsements to decide whether to formally declare their intentions to run."},{"Date-text":"June 29","Date-formatted":"2018-06-14","Title":"Absentee and early voting opens for primary election","Text":"Minnesotans can cast their votes up to 46 days before an election by filing a no-excuse absentee ballot either in person or by mail. The program has proven popular, with about <a href=\"http://www.startribune.com/voter-turnout-fell-in-mn-but-the-state-s-back-on-top/400746791/\">one in five voters</a> casting early ballots during the general election in 2016.","links":["<a href=\"https://www.sos.state.mn.us/elections-voting/other-ways-to-vote/\">How to vote early and absentee</a>"]},{"Date-text":"July 24","Date-formatted":"2018-07-24","Title":"Pre-registration ends for primary election","Text":"This is the last day to pre-register to vote before the primary. You can also register at your polling place on Election Day, but registering in advance allows you to save time.","links":["<a href=\"https://www.sos.state.mn.us/elections-voting/register-to-vote/\">How to register to vote</a>"]},{"Date-text":"Aug. 14","Date-formatted":"2018-08-14","Title":"Primary election day","Text":"Winners of the primary election will move on to face each other in the general election in November. In most places, polls open at 7 a.m. and close at 8 p.m. The Star Tribune will provide coverage throughout the day.","links":["<a href=\"https://pollfinder.sos.state.mn.us/\">Find your polling place</a>","<a href=\"https://www.sos.state.mn.us/elections-voting/election-day-voting\">How to vote on Election Day</a>"]},{"Date-text":"Sept. 3","Date-formatted":"2018-09-03","Title":"Labor Day","Text":"Often regarded as the unofficial start to campaign season, when news coverage heats up and candidates begin to spend the money they have been raising. Voters can expect to start seeing more advertisements — particularly considering that Minnesota is home to four of the nation’s most competitive Congressional races, which are expected to attract major spending from outside political groups.","links":["<a href=\"http://www.startribune.com/campaign-finance-2018-minnesota-governor-tim-walz-leads-money-race-tim-pawlenty-close-behind/478334513/\">Track how much money candidates are raising and spending</a>"]},{"Date-text":"Sept. 21","Date-formatted":"2018-09-21","Title":"Absentee and early voting opens for general election","Text":"Similar to the primary election, voters can begin casting early ballots for the general election in November."},{"Date-text":"Oct. 16","Date-formatted":"2018-10-16","Title":"Pre-registration ends for general election","Text":"The last day for voters to register early before the general election."},{"Date-text":"Nov. 6","Date-formatted":"2018-11-06","Title":"General election","Text":"This is it: Election Day. Minnesota routinely boasts <a href=\"http://www.startribune.com/minnesota-had-the-nation-s-highest-voter-turnout-again-here-s-one-reason-why/416247753/\">the highest voter turnout in the nation</a>, and being home to so many competitive races with the potential to influence national politics, excitement and anticipation will be high. Polls in most places open at 7 a.m. and close at 8 p.m."}]}
